# IsHookLengthOverrideEnabled Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..IsHookLengthOverrideEnabled Method
Rebar Class See Also
---
Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsHookLengthOverrideEnabled()
```

Visual Basic
---
```text
Public Function IsHookLengthOverrideEnabled As Boolean
```

Visual C++
---
```text
public:
bool IsHookLengthOverrideEnabled()
```

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace